# Introduction to Data Analysis using Python

This notebook mainly focuses on data analysis in Python which is done using Pandas library.

I will start this by importing Numpy and Pandas libraries.

In [7]:
import numpy as np
import pandas as pd

## Series

A Series is a one dimensional array that can hold any data type viz. strings, integer, floating number, objects etc. 

The data in a Series can be,

* Python dictionary
* An array
* A value

### From ndarray

If a Series is created from an ndarray, **index** must be the same length as **data**. If no index is passed, one will be created having values [0, ..., len(data) - 1].

In [3]:
#np.random.randn() throws random numbers based on the size entered
a = pd.Series(np.random.randn(5), index = ['a','b','c','d','e'])
a

a   -0.056182
b    0.851058
c    1.589496
d   -0.074197
e   -1.166115
dtype: float64

In [4]:
b = pd.Series(np.random.randn(5))
b

0   -0.166011
1    0.221160
2    0.594150
3   -0.318020
4   -1.199077
dtype: float64

### From dict

Series can be created from a dictionary which is a data type in Python as an unordered set of keys and respective values.

In [5]:
d = {'a':1, 'b':2,'c':3, 'd':4}
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [6]:
c = pd.Series(d)
c

a    1
b    2
c    3
d    4
dtype: int64

### Slicing

In [7]:
#Indexing in Python starts from 0 unlike 1 in R
a[0]

-0.056182221090673182

In [8]:
a[:3]

a   -0.056182
b    0.851058
c    1.589496
dtype: float64

In [9]:
a[3:]

d   -0.074197
e   -1.166115
dtype: float64

In [10]:
a[a > a.mean()]

b    0.851058
c    1.589496
dtype: float64

In [12]:
a[[1,4]]

b    0.851058
e   -1.166115
dtype: float64

A Series can be indexed and values can be set based on the index labels.

In [13]:
d['b']

2

In [15]:
d['c'] = 5
d

{'a': 1, 'b': 2, 'c': 5, 'd': 4}

## DataFrames

A DataFrame is 2-dimensional data structure with different data types. It is similar to a SQL table.

It can have different kinds of input,

* dict
* ndarray
* Series
* another DataFrame

### From dict of Series

In [16]:
d = {'a': pd.Series([1,2,3]),
    'b': pd.Series([4,5,6,7])}
d

{'a': 0    1
 1    2
 2    3
 dtype: int64, 'b': 0    4
 1    5
 2    6
 3    7
 dtype: int64}

In [18]:
df = pd.DataFrame(d)
df

     a  b
0  1.0  4
1  2.0  5
2  3.0  6
3  NaN  7

In [19]:
pd.DataFrame(d, index = ['one','two','thr','four'])

       a   b
one  NaN NaN
two  NaN NaN
thr  NaN NaN
four NaN NaN

In [22]:
#changing the index of df
df.index = ['one','two','thr','four']
df

        a  b
one   1.0  4
two   2.0  5
thr   3.0  6
four  NaN  7

In [23]:
df.columns = ['aaa','bbb']
df

      aaa  bbb
one   1.0    4
two   2.0    5
thr   3.0    6
four  NaN    7

In [24]:
df['ccc'] = df['aaa'] * df['bbb']
df

      aaa  bbb   ccc
one   1.0    4   4.0
two   2.0    5  10.0
thr   3.0    6  18.0
four  NaN    7   NaN

In [25]:
df['ddd'] = 10
df

      aaa  bbb   ccc  ddd
one   1.0    4   4.0   10
two   2.0    5  10.0   10
thr   3.0    6  18.0   10
four  NaN    7   NaN   10

Getting summary of a dataframe

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, one to four
Data columns (total 4 columns):
aaa    3 non-null float64
bbb    4 non-null int64
ccc    3 non-null float64
ddd    4 non-null int64
dtypes: float64(2), int64(2)
memory usage: 160.0+ bytes



Getting dimensions (rows, columns) of a dataframe

In [34]:
#dimension of dataframe
df.shape

(4, 4)

In [35]:
#cross multiplication of rows*columns
df.size

16

In [36]:
#no. of rows
len(df)

4

In [37]:
#no. of columns
len(df.columns)

4

### Indexing/Selecting Data

Basics of indexing are as follows.

* *df[col]*       : selects a column and returns a Series
* *df.loc[label]* : select a row by lable and returns a Series
* *df.iloc[loc]*  : select row by integer location and returns Series
* *df[5:10]*      : slice by rows and returns DataFrame

In [26]:
df.loc['one']

aaa     1.0
bbb     4.0
ccc     4.0
ddd    10.0
Name: one, dtype: float64

In [29]:
df.iloc[1]

aaa     2.0
bbb     5.0
ccc    10.0
ddd    10.0
Name: two, dtype: float64

In [30]:
df.iloc[1:4]

      aaa  bbb   ccc  ddd
two   2.0    5  10.0   10
thr   3.0    6  18.0   10
four  NaN    7   NaN   10

In [31]:
df['aaa'].loc['two']

2.0

Indexing based on column condition

In [41]:
df.loc[(df['bbb'] > 4)]

      aaa  bbb   ccc  ddd
two   2.0    5  10.0   10
thr   3.0    6  18.0   10
four  NaN    7   NaN   10

Indexing based on column condition and return required columns

In [42]:
df.loc[(df['bbb'] > 4), ['aaa', 'bbb']]

      aaa  bbb
two   2.0    5
thr   3.0    6
four  NaN    7

In [48]:
df.iloc[:3, :2]

     aaa  bbb
one  1.0    4
two  2.0    5
thr  3.0    6

In [50]:
df['aaa']

one     1.0
two     2.0
thr     3.0
four    NaN
Name: aaa, dtype: float64

### Descriptive Statistics

The methods here usually take an **axis** argument. axis = 0 for index which is default and axis = 1 for column

All such methods have a **skipna** option signaling whether to exclude missing data (*True* by default)

In [55]:
df

      aaa  bbb   ccc  ddd
one   1.0    4   4.0   10
two   2.0    5  10.0   10
thr   3.0    6  18.0   10
four  NaN    7   NaN   10

In [59]:
df.sum(axis = 1)

one     19.0
two     27.0
thr     37.0
four    17.0
dtype: float64

In [58]:
df.sum(skipna=False)

aaa     NaN
bbb    22.0
ccc     NaN
ddd    40.0
dtype: float64

In [64]:
df.cumsum(skipna=True)

      aaa   bbb   ccc   ddd
one   1.0   4.0   4.0  10.0
two   3.0   9.0  14.0  20.0
thr   6.0  15.0  32.0  30.0
four  NaN  22.0   NaN  40.0

In [62]:
#standardization
stand = (df - df.mean())/df.std()
stand

      aaa       bbb       ccc  ddd
one  -1.0 -1.161895 -0.949158  NaN
two   0.0 -0.387298 -0.094916  NaN
thr   1.0  0.387298  1.044074  NaN
four  NaN  1.161895       NaN  NaN

In [66]:
m = pd.Series([1,2,3,3,3,5,5,1,1,1,3,8,6])
m.mode()

0    1
1    3
dtype: int64

In [77]:
m1 = pd.DataFrame({'A':np.random.randint(0,9,size=20), 'B':np.random.randint(5,15, size=20)})
m1.mode()

   A    B
0  3  5.0
1  7  NaN

### Creating Bins

Continuous values can be discretized using *cut()* (bins based on values) and *qcut()* (based on sample quartiles)

In [98]:
bi = np.random.randn(30)
bi

array([ 1.41805058,  0.50229556, -0.70807939,  0.14304366,  1.01568414,
       -0.75280382, -0.70346642, -1.35709992,  0.7990657 , -3.08614507,
       -0.37633666, -0.59411499, -0.83032898, -1.18065691,  1.74873333,
       -0.23210661, -1.90833862, -0.6351842 , -0.67019114,  0.21082989,
       -0.6381892 , -1.41421306,  0.13982245, -0.45466041, -0.23013597,
       -0.78124001, -0.11164974,  1.94078826,  1.37348855, -0.08824144])

In [101]:
pd.cut(bi, 5)

[(0.935, 1.941], (-0.07, 0.935], (-1.0754, -0.07], (-0.07, 0.935], (0.935, 1.941], ..., (-1.0754, -0.07], (-1.0754, -0.07], (0.935, 1.941], (0.935, 1.941], (-1.0754, -0.07]]
Length: 30
Categories (5, object): [(-3.0912, -2.0808] < (-2.0808, -1.0754] < (-1.0754, -0.07] < (-0.07, 0.935] < (0.935, 1.941]]

In [102]:
pd.cut(bi,5).value_counts()

(-3.0912, -2.0808]     1
(-2.0808, -1.0754]     4
(-1.0754, -0.07]      15
(-0.07, 0.935]         5
(0.935, 1.941]         5
dtype: int64

In [109]:
pd.qcut(bi,[0,0.25,0.5,0.75,1]).value_counts()

[-3.0861, -0.742]    8
(-0.742, -0.415]     7
(-0.415, 0.194]      7
(0.194, 1.941]       8
dtype: int64

### Working with Missing Data

In [117]:
df1 = pd.DataFrame({'one':np.random.randn(5), 'two':list('aeiou')}, index = ('a','c','e','g','h'))
df1

        one two
a -0.912216   a
c -0.660245   e
e  0.845405   i
g -0.760448   o
h  0.567884   u

In [151]:
df2 = df1.reindex(['a','b','c','d','e','g','h'])
df2

        one  two
a -0.912216    a
b       NaN  NaN
c -0.660245    e
d       NaN  NaN
e  0.845405    i
g -0.760448    o
h  0.567884    u

In [125]:
df2.isnull()

     one    two
a  False  False
b   True   True
c  False  False
d   True   True
e  False  False
g  False  False
h  False  False

In [126]:
df2.notnull()

     one    two
a   True   True
b  False  False
c   True   True
d  False  False
e   True   True
g   True   True
h   True   True

In [152]:
df2['three'] = np.random.randint(0,10, size = len(df2))
df2

        one  two  three
a -0.912216    a      2
b       NaN  NaN      2
c -0.660245    e      0
d       NaN  NaN      9
e  0.845405    i      1
g -0.760448    o      5
h  0.567884    u      0

In [153]:
df2['one'].sum()

-0.9196203150984694

In [154]:
df2.iloc[4, 2] = None
df2

        one  two  three
a -0.912216    a    2.0
b       NaN  NaN    2.0
c -0.660245    e    0.0
d       NaN  NaN    9.0
e  0.845405    i    NaN
g -0.760448    o    5.0
h  0.567884    u    0.0

In [155]:
df2.mean()

one     -0.183924
three    3.000000
dtype: float64

In [161]:
df2[['one','three']].fillna(df2[['one','three']].mean())
#df2

        one  three
a -0.912216    2.0
b -0.183924    2.0
c -0.660245    0.0
d -0.183924    9.0
e  0.845405    3.0
g -0.760448    5.0
h  0.567884    0.0

In [165]:
df2.fillna(df2.mean())

        one  two  three
a -0.912216    a    2.0
b -0.183924  NaN    2.0
c -0.660245    e    0.0
d -0.183924  NaN    9.0
e  0.845405    i    3.0
g -0.760448    o    5.0
h  0.567884    u    0.0

In [166]:
df3 = df2[['one','three']]
df3.fillna(0)

        one  three
a -0.912216    2.0
b  0.000000    2.0
c -0.660245    0.0
d  0.000000    9.0
e  0.845405    0.0
g -0.760448    5.0
h  0.567884    0.0

In [170]:
df2.fillna(df2.mean()['one':'three'])

        one  two  three
a -0.912216    a    2.0
b -0.183924  NaN    2.0
c -0.660245    e    0.0
d -0.183924  NaN    9.0
e  0.845405    i    3.0
g -0.760448    o    5.0
h  0.567884    u    0.0

In [171]:
df2.dropna()

        one two  three
a -0.912216   a    2.0
c -0.660245   e    0.0
g -0.760448   o    5.0
h  0.567884   u    0.0

### Groupby

In [181]:
df3 = pd.DataFrame({'A':['one','two','one','one','three','three','two','two','four','two'],
                   'B':['aaa','bbb','ccc','ccc','ddd','bbb','aaa','bbb','eee','aaa'],
                   'C':np.random.randn(10),
                   'D':np.random.rand(10)})
df3

       A    B         C         D
0    one  aaa -1.161795  0.592734
1    two  bbb  0.356687  0.874028
2    one  ccc  0.496305  0.004049
3    one  ccc  0.066921  0.867182
4  three  ddd -0.581905  0.933954
5  three  bbb -0.540484  0.614992
6    two  aaa  0.672938  0.871442
7    two  bbb  1.233322  0.729429
8   four  eee -0.699898  0.962628
9    two  aaa  0.431778  0.665069

In [202]:
df3.groupby(['A','B']).sum()

                  C         D
A     B
four  eee -0.699898  0.962628
one   aaa -1.161795  0.592734
      ccc  0.563225  0.871232
three bbb -0.540484  0.614992
      ddd -0.581905  0.933954
two   aaa  1.104716  1.536511
      bbb  1.590009  1.603457


By default the group names will be sorted buy the items in it. To change this we cas use *sort* option.

By default the group names will be new grouped index along the axis. This can be changed by passing * as_index * option

In [203]:
df3.groupby(['A','B'], sort=False).sum()

                  C         D
A     B
one   aaa -1.161795  0.592734
two   bbb  1.590009  1.603457
one   ccc  0.563225  0.871232
three ddd -0.581905  0.933954
      bbb -0.540484  0.614992
two   aaa  1.104716  1.536511
four  eee -0.699898  0.962628

In [201]:
df3.groupby(['A','B'], as_index=False).mean()

       A    B         C         D
0   four  eee -0.699898  0.962628
1    one  aaa -1.161795  0.592734
2    one  ccc  0.281613  0.435616
3  three  bbb -0.540484  0.614992
4  three  ddd -0.581905  0.933954
5    two  aaa  0.552358  0.768255
6    two  bbb  0.795005  0.801729

In [209]:
df3.groupby('A').agg([np.sum, np.mean])

              C                   D
            sum      mean       sum      mean
A
four  -0.699898 -0.699898  0.962628  0.962628
one   -0.598570 -0.199523  1.463965  0.487988
three -1.122389 -0.561194  1.548947  0.774473
two    2.694726  0.673681  3.139968  0.784992

### Filtration

The *filter* method returns a subset of the original object. Suppose we want to take only elements that belong to groups with a group sum greater than 0.5.

Below is an example when dataframe has multiple columns.

In [213]:
df3.groupby('A').filter(lambda x:x['C'].sum() > 0.5)

#if dataframe has only single column to filer, below line can be used.
#df3.groupby('A').filter(lambda x: x.sum() > 2)

     A    B         C         D
1  two  bbb  0.356687  0.874028
6  two  aaa  0.672938  0.871442
7  two  bbb  1.233322  0.729429
9  two  aaa  0.431778  0.665069

### Apply

Some operations on the grouped data might not fit into either the aggregate or transform categories. Or, you may simply want GroupBy to infer how to combine the results. For these, use the apply function, which can be substituted for both aggregate and transform in many standard use cases. However, apply can handle some exceptional use cases

In [214]:
df3.groupby('A').apply(lambda x: x.describe())

                    C         D
A
four  count  1.000000  1.000000
      mean  -0.699898  0.962628
      std         NaN       NaN
      min   -0.699898  0.962628
      25%   -0.699898  0.962628
      50%   -0.699898  0.962628
      75%   -0.699898  0.962628
      max   -0.699898  0.962628
one   count  3.000000  3.000000
      mean  -0.199523  0.487988
      std    0.860563  0.440997
      min   -1.161795  0.004049
      25%   -0.547437  0.298391
      50%    0.066921  0.592734
      75%    0.281613  0.729958
      max    0.496305  0.867182
three count  2.000000  2.000000
      mean  -0.561194  0.774473
      std    0.029289  0.225540
      min   -0.581905  0.614992
      25%   -0.571550  0.694733
      50%   -0.561194  0.774473
      75%   -0.550839  0.854214
      max   -0.540484  0.933954
two   count  4.000000  4.000000
      mean   0.673681  0.784992
      std    0.396737  0.104674
      min    0.356687  0.665069
      25%    0.413005  0.713339
      50%    0.552358  0.800435
      75%    0.813034  0.872088
      max    1.233322  0.874028

In [221]:
df = pd.DataFrame([[1, np.nan], [1, 4], [5, 6]], columns=['A', 'B'])
df

   A    B
0  1  NaN
1  1  4.0
2  5  6.0

In [228]:
#select nth item from dataframe use nth() function. This returns single row per group.
df3.groupby('A').nth(0)

         B         C         D
A
four   eee -0.699898  0.962628
one    aaa -1.161795  0.592734
three  ddd -0.581905  0.933954
two    bbb  0.356687  0.874028

### Merge, Join and Concatenate

#### concat()

In [8]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [9]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
   ...:                     'B': ['B4', 'B5', 'B6', 'B7'],
   ...:                     'C': ['C4', 'C5', 'C6', 'C7'],
   ...:                     'D': ['D4', 'D5', 'D6', 'D7']},
   ...:                      index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
   ...:                     'B': ['B8', 'B9', 'B10', 'B11'],
   ...:                     'C': ['C8', 'C9', 'C10', 'C11'],
   ...:                     'D': ['D8', 'D9', 'D10', 'D11']},
   ...:                     index=[8, 9, 10, 11])

In [13]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [16]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
   ...:                     'D': ['D2', 'D3', 'D6', 'D7'],
   ...:                     'F': ['F2', 'F3', 'F6', 'F7']},
   ...:                    index=[2, 3, 6, 7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [15]:
pd.concat([df1,df4], axis = 1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

#### merge()

*merge()* provides database style joining and is also a high performer in memory operations.


|**Merge Method**| **Description**|
|----------------|----------------|
|left            |Use keys from left frame only|
|right|Use keys from right frame only|
|outer|Use union of keys from both frames|
|inner|Use intersection of keys from both frames|

*inner* is the default method.

In [17]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                      'A': ['A0', 'A1', 'A2', 'A3'],
   ....:                      'B': ['B0', 'B1', 'B2', 'B3']})
   ....: 

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                       'C': ['C0', 'C1', 'C2', 'C3'],
   ....:                       'D': ['D0', 'D1', 'D2', 'D3']})

In [20]:
pd.merge(left, right, on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [21]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
   ....:                      'key2': ['K0', 'K1', 'K0', 'K1'],
   ....:                      'A': ['A0', 'A1', 'A2', 'A3'],
   ....:                      'B': ['B0', 'B1', 'B2', 'B3']})
   ....: 

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
   ....:                       'key2': ['K0', 'K0', 'K0', 'K0'],
   ....:                       'C': ['C0', 'C1', 'C2', 'C3'],
   ....:                       'D': ['D0', 'D1', 'D2', 'D3']})

In [22]:
pd.merge(left, right, on = ['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2


The how argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or right tables, the values in the joined table will be NA.

In [23]:
pd.merge(left, right, on = ['key1','key2'], how = 'left')

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [24]:
pd.merge(left, right, on = ['key1','key2'], how='right')

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [25]:
left = pd.DataFrame({'A' : [1,2], 'B' : [2, 2]})
right = pd.DataFrame({'A' : [4,5,6], 'B': [2,2,2]})
pd.merge(left,right, on = 'B', how = 'outer')

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6

### Pivot Tables & Reshaping

In [27]:
df3 = pd.DataFrame({'A':['one','two','one','one','three','three','two','two','four','two'],
                   'B':['aaa','bbb','ccc','ccc','ddd','bbb','aaa','bbb','eee','aaa'],
                   'C':np.random.randn(10),
                   'D':np.random.rand(10)})
df3

       A    B         C         D
0    one  aaa  0.026142  0.783584
1    two  bbb -1.045952  0.802622
2    one  ccc -0.291135  0.092884
3    one  ccc  0.787928  0.736502
4  three  ddd  1.332946  0.414963
5  three  bbb -0.082986  0.355600
6    two  aaa  0.000030  0.092975
7    two  bbb -0.567578  0.412670
8   four  eee  0.494013  0.247081
9    two  aaa -0.059749  0.248454

In [35]:
df3.pivot_table(index = 'A', columns = 'B', values='C')

B           aaa       bbb       ccc       ddd       eee
A
four        NaN       NaN       NaN       NaN  0.494013
one    0.026142       NaN  0.248397       NaN       NaN
three       NaN -0.082986       NaN  1.332946       NaN
two   -0.029859 -0.806765       NaN       NaN       NaN

In [36]:
df3.pivot_table(index = 'A', columns = 'B')

              C                                                 D            \
B           aaa       bbb       ccc       ddd       eee       aaa       bbb
A
four        NaN       NaN       NaN       NaN  0.494013       NaN       NaN
one    0.026142       NaN  0.248397       NaN       NaN  0.783584       NaN
three       NaN -0.082986       NaN  1.332946       NaN       NaN  0.355600
two   -0.029859 -0.806765       NaN       NaN       NaN  0.170715  0.607646


B           ccc       ddd       eee
A
four        NaN       NaN  0.247081
one    0.414693       NaN       NaN
three       NaN  0.414963       NaN
two         NaN       NaN       NaN

In [43]:
#pd.crosstab(df3['A'],df3['B']) or
pd.crosstab(df3.A, df3.B)

B      aaa  bbb  ccc  ddd  eee
A
four     0    0    0    0    1
one      1    0    2    0    0
three    0    1    0    1    0
two      2    2    0    0    0